src/cf/AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Комиссионер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыОперацийРеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРеализацияТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаКомиссия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Брак</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыПередачиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПередачиТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоСклада</Name>
					<Comment>(Общ) Реализация со склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыПоступленияТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(Общ) Поступление на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедениеВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВедениеВзаиморасчетовПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаиморасчетов</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУсловийДоговора</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУсловийДоговоровВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДержатьРезервБезОплатыОграниченноеВремя</Name>
					<Comment>(Упр) Держать резерв без оплаты ограниченное/неограниченное время</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимоеЧислоДнейЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьСуммуЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьЧислоДнейЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленныйУчетТоваровПоЗаказамПокупателей</Name>
					<Comment>(Общ) Обособленный партионный учет Товаров по заказам покупателей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПредоплаты</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаКомиссионногоВознаграждения</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаКомиссионногоВознаграждения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ) Тип цен по умолчанию для оформления документов по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатурыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоДнейРезерваБезОплаты</Name>
					<Comment>(Упр) Если 0, то не ограничено</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетАгентскогоНДС</Name>
					<Comment>Признак того что в данном договоре организация выступает в качестве налогового агента</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидАгентскогоДоговора</Name>
					<Comment>Разновидность договора с обязанностью оплаты организацией НДС в качестве налогового агента </Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАгентскихДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьДенежныеСредстваКомитента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыВУсловныхЕдиницах</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияНаЭкспорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиПоДокументамРасчетовСКонтрагентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПроект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРаспределенияПоПроектам</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяСтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокРегистрацииСчетовФактурНаАвансПоДоговору</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляСчетаФактурыНаАванс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ПроцедурыДокументоОборот/Ext/Module.bsl
Процедура СформироватьДокументы () Экспорт
	
    ГлобалТрейд = Справочники.Организации.НайтиПоКоду("662");
	КонтрГлобалТрейд = Справочники.Контрагенты.НайтиПоКоду("000089596");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.Номенклатура,
	               |	Рег.КоличествоОстаток КАК Количество,
	               |	Цены.Цена КАК Цена,
	               |	Цены.ЕдиницаИзмерения КАК Ед
	               |ИЗ
	               |	РегистрНакопления.ТоварыОрганизаций.Остатки(, Организация = &Организация) КАК Рег
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НачалоНедели, ТипЦен = &СЦЗ) КАК Цены
	               |		ПО Рег.Номенклатура = Цены.Номенклатура
	               |ГДЕ
	               |	Рег.КоличествоОстаток < 0";
	              
				   
	Запрос.УстановитьПараметр("Организация", ГлобалТрейд);
	Запрос.УстановитьПараметр("НачалоНедели",НачалоНедели(ТекущаяДата()));
	Запрос.УстановитьПараметр("СЦЗ",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000015"));
			
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Количество()=0 Тогда
		ОбработатьФитМилс();
		Возврат;
	КонецЕсли;
	
	
	Рел = СоздатьРелиз (КонтрГлобалТрейд);
	Если ТипЗнч(Рел)<>Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	
	Пост = СоздатьПоступление (ГлобалТрейд);
	Если ТипЗнч(Пост)<>Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
		
	Пока Выб.Следующий() Цикл
						
		НовСт = Рел.Товары.Добавить();
		НовСт.Номенклатура = Выб.Номенклатура;
		Если ЗначениеЗаполнено(Выб.Цена) Тогда
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = Выб.Цена/?(ЗначениеЗаполнено(Выб.Ед.Коэффициент),Выб.Ед.Коэффициент,1);
			Если НовСт.Цена = 0 Тогда 
				НовСт.Цена = 1;
			Иначе
				НовСт.Цена = (НовСт.Цена/100)+НовСт.Цена;
			КонецЕсли;
		Иначе
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = 1;
		КонецЕсли;
		
		НовСт.ЕдиницаИзмерения = Выб.Номенклатура.ЕдиницаХраненияОстатков;
		НовСт.Коэффициент = 1;
		НовСт.Качество = Справочники.Качество.Новый;
		НовСт.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
		НовСт.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСт, Рел);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСт, Рел);
		
				
		НовСт = Пост.Товары.Добавить();
		НовСт.Номенклатура = Выб.Номенклатура;
		Если ЗначениеЗаполнено(Выб.Цена) Тогда
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = Выб.Цена/?(ЗначениеЗаполнено(Выб.Ед.Коэффициент),Выб.Ед.Коэффициент,1);
			Если НовСт.Цена = 0 Тогда 
				НовСт.Цена = 1;
			Иначе
				НовСт.Цена = (НовСт.Цена/100)+НовСт.Цена;
			КонецЕсли;
		Иначе
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = 1;
		КонецЕсли;

		НовСт.ЕдиницаИзмерения = Выб.Номенклатура.ЕдиницаХраненияОстатков;
		НовСт.Коэффициент = 1;
		НовСт.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСт, Пост);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСт, Пост);
		НовСт.СуммаИзДокумента = НовСт.Сумма;

		
	КонецЦикла;
	
	Рел.Записать(РежимЗаписиДокумента.Проведение);
	Пост.Записать(РежимЗаписиДокумента.Проведение);
	
	
	/////03102018 Новая организация АКТИВ-ТРЕЙД ООО
	АктивТрейд = Справочники.Организации.НайтиПоКоду("677");
	КонтрАктивТрейд = Справочники.Контрагенты.НайтиПоКоду("000124139");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.Номенклатура,
	               |	Рег.КоличествоОстаток КАК Количество,
	               |	Цены.Цена КАК Цена,
	               |	Цены.ЕдиницаИзмерения КАК Ед
	               |ИЗ
	               |	РегистрНакопления.ТоварыОрганизаций.Остатки(, Организация = &Организация) КАК Рег
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НачалоНедели, ТипЦен = &СЦЗ) КАК Цены
	               |		ПО Рег.Номенклатура = Цены.Номенклатура
	               |ГДЕ
	               |	Рег.КоличествоОстаток < 0";
	              
				   
	Запрос.УстановитьПараметр("Организация", АктивТрейд);
	Запрос.УстановитьПараметр("НачалоНедели",НачалоНедели(ТекущаяДата()));
	Запрос.УстановитьПараметр("СЦЗ",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000015"));
			
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Количество()=0 Тогда
		ОбработатьФитМилс();
		Возврат;
	КонецЕсли;
	
	
	Рел = СоздатьРелиз (КонтрАктивТрейд);
	Если ТипЗнч(Рел)<>Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	
	Пост = СоздатьПоступление (АктивТрейд);
	Если ТипЗнч(Пост)<>Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
		
	Пока Выб.Следующий() Цикл
						
		НовСт = Рел.Товары.Добавить();
		НовСт.Номенклатура = Выб.Номенклатура;
		Если ЗначениеЗаполнено(Выб.Цена) Тогда
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = Выб.Цена/?(ЗначениеЗаполнено(Выб.Ед.Коэффициент),Выб.Ед.Коэффициент,1);
			Если НовСт.Цена = 0 Тогда 
				НовСт.Цена = 1;
			Иначе
				НовСт.Цена = (НовСт.Цена/100)+НовСт.Цена;
			КонецЕсли;
		Иначе
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = 1;
		КонецЕсли;
		
		НовСт.ЕдиницаИзмерения = Выб.Номенклатура.ЕдиницаХраненияОстатков;
		НовСт.Коэффициент = 1;
		НовСт.Качество = Справочники.Качество.Новый;
		НовСт.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
		НовСт.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСт, Рел);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСт, Рел);
		
				
		НовСт = Пост.Товары.Добавить();
		НовСт.Номенклатура = Выб.Номенклатура;
		Если ЗначениеЗаполнено(Выб.Цена) Тогда
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = Выб.Цена/?(ЗначениеЗаполнено(Выб.Ед.Коэффициент),Выб.Ед.Коэффициент,1);
			Если НовСт.Цена = 0 Тогда 
				НовСт.Цена = 1;
			Иначе
				НовСт.Цена = (НовСт.Цена/100)+НовСт.Цена;
			КонецЕсли;
		Иначе
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = 1;
		КонецЕсли;

		НовСт.ЕдиницаИзмерения = Выб.Номенклатура.ЕдиницаХраненияОстатков;
		НовСт.Коэффициент = 1;
		НовСт.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСт, Пост);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСт, Пост);
		НовСт.СуммаИзДокумента = НовСт.Сумма;

		
	КонецЦикла;
	
	Рел.Записать(РежимЗаписиДокумента.Проведение);
	Пост.Записать(РежимЗаписиДокумента.Проведение);

	
	ОбработатьФитМилс();
КонецПроцедуры

Процедура ОбработатьФитМилс()
	
	ФитМил = Справочники.Организации.НайтиПоКоду("661");
	КонтрФитМил = Справочники.Контрагенты.НайтиПоКоду("000112064");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Рег.Номенклатура,
	               |	Рег.КоличествоОстаток КАК Количество,
	               |	Цены.Цена КАК Цена,
	               |	Цены.ЕдиницаИзмерения КАК Ед
	               |ИЗ
	               |	РегистрНакопления.ТоварыОрганизаций.Остатки(, Организация = &Организация) КАК Рег
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&НачалоНедели, ТипЦен = &СЦЗ) КАК Цены
	               |		ПО Рег.Номенклатура = Цены.Номенклатура
	               |ГДЕ
	               |	Рег.КоличествоОстаток < 0";
	              
				   
    Запрос.УстановитьПараметр("Организация", ФитМил);
	Запрос.УстановитьПараметр("НачалоНедели",НачалоНедели(ТекущаяДата()));
	Запрос.УстановитьПараметр("СЦЗ",Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000015"));
		
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Количество()=0 Тогда
		Возврат;
	КонецЕсли;

	
	Рел = СоздатьРелиз (КонтрФитМил);
	Если ТипЗнч(Рел)<>Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;
	
	Пост = СоздатьПоступление (ФитМил);
	Если ТипЗнч(Пост)<>Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		Возврат;
	КонецЕсли;


	
	Выб = Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
						
		НовСт = Рел.Товары.Добавить();
		НовСт.Номенклатура = Выб.Номенклатура;
		Если ЗначениеЗаполнено(Выб.Цена) Тогда
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = Выб.Цена/?(ЗначениеЗаполнено(Выб.Ед.Коэффициент),Выб.Ед.Коэффициент,1);
			Если НовСт.Цена = 0 Тогда 
				НовСт.Цена = 1;
			Иначе
				НовСт.Цена = (НовСт.Цена/100)+НовСт.Цена;
			КонецЕсли;
		Иначе
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = 1;
		КонецЕсли;
		
		НовСт.ЕдиницаИзмерения = Выб.Номенклатура.ЕдиницаХраненияОстатков;
		НовСт.Коэффициент = 1;
		НовСт.Качество = Справочники.Качество.Новый;
		НовСт.СпособСписанияОстаткаТоваров = Перечисления.СпособыСписанияОстаткаТоваров.СоСклада;
		НовСт.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСт, Рел);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСт, Рел);
		
				
		НовСт = Пост.Товары.Добавить();
		НовСт.Номенклатура = Выб.Номенклатура;
		Если ЗначениеЗаполнено(Выб.Цена) Тогда
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = Выб.Цена/?(ЗначениеЗаполнено(Выб.Ед.Коэффициент),Выб.Ед.Коэффициент,1);
			Если НовСт.Цена = 0 Тогда 
				НовСт.Цена = 1;
			Иначе
				НовСт.Цена = (НовСт.Цена/100)+НовСт.Цена;
			КонецЕсли;
		Иначе
			НовСт.Количество = -Выб.Количество;
			НовСт.Цена = 1;
		КонецЕсли;

		НовСт.ЕдиницаИзмерения = Выб.Номенклатура.ЕдиницаХраненияОстатков;
		НовСт.Коэффициент = 1;
		НовСт.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
		ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(НовСт, Пост);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(НовСт, Пост);
		НовСт.СуммаИзДокумента = НовСт.Сумма;

		
	КонецЦикла;
	
	Рел.Записать(РежимЗаписиДокумента.Проведение);
	Пост.Записать(РежимЗаписиДокумента.Проведение);

	
	
КонецПроцедуры

Функция СоздатьРелиз (Контр)
	
	Реал = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	Реал.ВидОперации=Перечисления.ВидыОперацийРеализацияТоваров.ПродажаКомиссия;
	Реал.ВидПередачи=Перечисления.ВидыПередачиТоваров.СоСклада;
	Реал.Дата = НачалоНедели(ТекущаяДата());
	Реал.Организация = Справочники.Организации.НайтиПоКоду("000000001");//5лб
	Реал.Контрагент = Контр;
	Реал.ДоговорКонтрагента = Реал.Контрагент.ОсновнойДоговорКонтрагента;
	Реал.ОтражатьВУправленческомУчете=Истина;
	Реал.Склад = Справочники.Склады.НайтиПоКоду("000000005");
	Реал.ВалютаДокумента=Справочники.Валюты.НайтиПоКоду("643");
	Реал.КурсВзаиморасчетов=1;
	Реал.КратностьВзаиморасчетов=1;
	Реал.УчитыватьНДС=Истина;
	Реал.СуммаВключаетНДС=Истина;
		
	Возврат Реал;
	
КонецФункции

Функция СоздатьПоступление (Орг)
	
	Пост = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	Пост.ВидПоступления=Перечисления.ВидыПоступленияТоваров.НаСклад;
	Пост.Дата = НачалоНедели(ТекущаяДата())+60;
	Пост.ДатаС = Пост.Дата;
	Пост.ДатаПо = Пост.Дата;
	Пост.Организация = Орг;
	Пост.Контрагент = Справочники.Контрагенты.НайтиПоКоду("000112062");
	Если Орг=Справочники.Организации.НайтиПоКоду("662")  Тогда
		Пост.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию("СГлобалТрейд",Истина);
	//03102018 Новая организация АКТИВ-ТРЕЙД ООО	
	ИначеЕсли Орг=Справочники.Организации.НайтиПоКоду("677")  Тогда
		Пост.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию("САктивТрейд",Истина);
	Иначе
		Пост.ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.НайтиПоНаименованию("СФитМилс",Истина);
	КонецЕсли;
	Пост.ОтражатьВУправленческомУчете=Истина;
	Пост.СкладОрдер = Справочники.Склады.НайтиПоКоду("000000005");
	Пост.ВалютаДокумента=Справочники.Валюты.НайтиПоКоду("643");
	Пост.КурсВзаиморасчетов=1;
	Пост.КратностьВзаиморасчетов=1;
	Пост.УчитыватьНДС=Истина;
	Пост.СуммаВключаетНДС=Истина;
			
	Возврат Пост;

	
КонецФункции
